Tekla Open API Reference for Tekla Structures 2025
LoadGroup.GroupName Property
 The load group name. The maximum size is 126 characters.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string GroupName { get; set; }
Public Property GroupName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
LoadGroup Class
Tekla.Structures.Model Namespace